/*************************************
2016 POSTECH SMP Week6-1
Q.아래 연립 방정식에서 a00~a11, b0~1을
입력 받아 2차원 배열을 이용하여
X, y값을 출력하는 프로그램을 만드시오

//////////////////////////////////////
a00x + a01y = b0
a10x + a11y = b1
//////////////////////////////////////

**************************************/

#include <stdio.h>

int main(void) {
	float a[2][2];
	float b[2];
	int i, j;
	float x, y, d;
	
	//a, b모두 입력 받음
	for (i = 0; i < 2; i++) {
		for (j = 0; j < 2; j++) {
			scanf("%f", &a[i][j]);
		}
	}
	scanf("%f%f", &b[0], &b[1]);

	//determinent
	d = a[0][0] * a[1][1] - a[0][1] * a[1][0];

	//inverse matrix로 해 구하기
	x = (a[1][1] * b[0] - a[0][1] * b[1]) / d;
	y = (-a[1][0] * b[0] + a[0][0] * b[1]) / d;

	printf("x: %f\n", x);
	printf("y: %f\n", y);
	return 0;
}